wiki/2016-06-10-python-kill-process-in-windows.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://bruceasu.github.io/rss.xml"
      title="RSS feed for https://bruceasu.github.io/"/>
<title>python kill process in windows (转)</title>
<meta name="author" content="Bruce">
<meta name="referrer" content="no-referrer">
<link href= "/styles/org-manual.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rel="stylesheet" href="/styles/font.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/post.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/post_mobile.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/navigatebar.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/navigatebar_mobile.css">
<link rel="stylesheet" href="/theme/highlight.css">

</head>
<body>
<div class="navigatebar">
    <div class="navigatebar-button navigatebar-mine">
        <a href="/index.html">Free World</a>
    </div>
    <div class="navigatebar-slogan">
        「生活可以更简单, 欢迎来到我的开源世界」
    </div>
    <div class="navigatebar-button">
        <a href="/index.html">Home</a>
    </div>
    <div class="navigatebar-button">
        <a href="/tags.html">Tags</a>
    </div>
    <div class="navigatebar-button">
        <a href="/rss.xml">Feeds</a>
    </div>
    <div class="navigatebar-button navigatebar-about">
        <a href="/about.html">About</a>
    </div>
</div>

      <div class="content-area">
<div class="title">python kill process in windows (转)</div>
<div class="category-area"><a href="https://bruceasu.github.io/tags.html#python"><div class="category">python</div></a> <a href="https://bruceasu.github.io/tags.html#reprint"><div class="category">reprint</div></a> </div>
<div class="char-counter">2016-06-10</div>
        <div id="content">
<p>
本篇Python语言源码为：如何在windows平台下如何用Python杀进程的方法。主要的思路是
在Python程序设置一个timeout，条件是一定时间内，如果这个程序没有返回，那么执行“杀
掉这个这个新开的进程”。这就是我大概的思路，大家也可以自由发挥用你们的方法来杀进
程。
</p>

<p>
如下就是我用Python杀进程的方法（windows）源码：需要用到ctypes、sys两个方法模块
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> ctypes
<span style="font-weight: bold;">import</span> sys

<span style="font-weight: bold; font-style: italic;">TH32CS_SNAPPROCESS</span> = 0x00000002

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">PROCESSENTRY32</span>(ctypes.Structure):
     <span style="font-weight: bold; font-style: italic;">_fields_</span> = [(<span style="font-style: italic;">"dwSize"</span>, ctypes.c_ulong),
                 (<span style="font-style: italic;">"cntUsage"</span>, ctypes.c_ulong),
                 (<span style="font-style: italic;">"th32ProcessID"</span>, ctypes.c_ulong),
                 (<span style="font-style: italic;">"th32DefaultHeapID"</span>, ctypes.c_ulong),
                 (<span style="font-style: italic;">"th32ModuleID"</span>, ctypes.c_ulong),
                 (<span style="font-style: italic;">"cntThreads"</span>, ctypes.c_ulong),
                 (<span style="font-style: italic;">"th32ParentProcessID"</span>, ctypes.c_ulong),
                 (<span style="font-style: italic;">"pcPriClassBase"</span>, ctypes.c_ulong),
                 (<span style="font-style: italic;">"dwFlags"</span>, ctypes.c_ulong),
                 (<span style="font-style: italic;">"szExeFile"</span>, ctypes.c_char * 260)]

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">getProcList</span>():
    <span style="font-weight: bold; font-style: italic;">CreateToolhelp32Snapshot</span> = ctypes.windll.kernel32.CreateToolhelp32Snapshot
    <span style="font-weight: bold; font-style: italic;">Process32First</span> = ctypes.windll.kernel32.Process32First
    <span style="font-weight: bold; font-style: italic;">Process32Next</span> = ctypes.windll.kernel32.Process32Next
    <span style="font-weight: bold; font-style: italic;">CloseHandle</span> = ctypes.windll.kernel32.CloseHandle
    <span style="font-weight: bold; font-style: italic;">hProcessSnap</span> = CreateToolhelp32Snapshot(TH32CS_SNAPPROCESS, 0)
    <span style="font-weight: bold; font-style: italic;">pe32</span> = PROCESSENTRY32()
    <span style="font-weight: bold; font-style: italic;">pe32.dwSize</span> = ctypes.sizeof(PROCESSENTRY32)

    <span style="font-weight: bold;">if</span> Process32First(hProcessSnap,ctypes.byref(pe32)) == <span style="font-weight: bold; text-decoration: underline;">False</span>:
        <span style="font-weight: bold;">print</span> &gt;&gt; sys.stderr, <span style="font-style: italic;">"Failed getting first process."</span>
        <span style="font-weight: bold;">return</span>

    <span style="font-weight: bold;">while</span> <span style="font-weight: bold; text-decoration: underline;">True</span>:
        <span style="font-weight: bold;">yield</span> pe32
        <span style="font-weight: bold;">if</span> Process32Next(hProcessSnap,ctypes.byref(pe32)) == <span style="font-weight: bold; text-decoration: underline;">False</span>:
            <span style="font-weight: bold;">break</span>
    CloseHandle(hProcessSnap)

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">getChildPid</span>(pid):

    <span style="font-weight: bold; font-style: italic;">procList</span> = getProcList()

    <span style="font-weight: bold;">for</span> proc <span style="font-weight: bold;">in</span> procList:

        <span style="font-weight: bold;">if</span> proc.th32ParentProcessID == pid:
            <span style="font-weight: bold;">yield</span> proc.th32ProcessID

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">killPid</span>(pid):

    <span style="font-weight: bold; font-style: italic;">childList</span> = getChildPid(pid)

    <span style="font-weight: bold;">for</span> childPid <span style="font-weight: bold;">in</span> childList:
        killPid(childPid)

    <span style="font-weight: bold; font-style: italic;">handle</span> = ctypes.windll.kernel32.OpenProcess(1, <span style="font-weight: bold; text-decoration: underline;">False</span>, pid)

    ctypes.windll.kernel32.TerminateProcess(handle,0)


<span style="font-weight: bold;">if</span> <span style="font-weight: bold;">__name__</span> ==<span style="font-style: italic;">'__main__'</span>:

    <span style="font-weight: bold; font-style: italic;">args</span> = sys.argv

    <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">len</span>(args) &gt;1 :
        <span style="font-weight: bold; font-style: italic;">pid</span> = <span style="font-weight: bold;">int</span>(args[1])
        killPid(pid)

    <span style="font-weight: bold;">else</span>:
        <span style="font-weight: bold; font-style: italic;">procList</span> = getProcList()
        <span style="font-weight: bold;">for</span> proc <span style="font-weight: bold;">in</span> procList:
            <span style="font-weight: bold;">print</span> proc.szExeFile+<span style="font-style: italic;">'  '</span>+<span style="font-weight: bold;">str</span>(proc.th32ParentProcessID) + <span style="font-style: italic;">'  '</span>+<span style="font-weight: bold;">str</span>(proc.th32ProcessID)

</pre>
</div>

<p>
另一個例子，使用了winproc模塊：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> subprocess
<span style="font-weight: bold;">import</span> time
<span style="font-weight: bold;">import</span> winproc

<span style="font-weight: bold; font-style: italic;">timeout</span> = 2

<span style="font-weight: bold; font-style: italic;">process</span> = subprocess.Popen(<span style="font-style: italic;">"cmd /k ping localhost -t"</span>,shell = <span style="font-weight: bold; text-decoration: underline;">True</span>)

<span style="font-weight: bold; font-style: italic;">start</span> = <span style="font-weight: bold;">int</span>(time.time())

<span style="font-weight: bold;">while</span> process.poll()==<span style="font-weight: bold; text-decoration: underline;">None</span>:

    <span style="font-weight: bold; font-style: italic;">now</span> = <span style="font-weight: bold;">int</span>(time.time())

    <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">int</span> (now - start) &gt;timeout:
        <span style="font-weight: bold; font-style: italic;">pid</span> = process.pid
        <span style="font-weight: bold;">break</span>

winproc.killPid(pid)

<span style="font-weight: bold;">print</span> <span style="font-style: italic;">"End"</span>

</pre>
</div>

<p>
网上还有好多关于 用Python语言杀进程的方法，但都不是太完整。希望我的这个源码能帮
到有这方面需求的朋友们。
</p>

        </div>    </div>
    <div id="postamble" class="status"><div id="archive" style="padding-top: 3em; padding-bottom: 2em;"><a href="/archive.html">其它文章</a></div><script src="/js/av-min-1.5.0.js"></script>    </div>
</body>
</html>
